In [2]:
import sqlite3
import pandas as pd

df = pd.read_csv("Ecommerce.csv")

conn = sqlite3.connect("ecommerce.db")

df.to_sql("ecommerce", conn, if_exists="replace", index=False)

conn.close()

In [9]:
%%sql 
sqlite:///ecommerce.db

select customer_id, sum(quantity * unit_price) As total_revenue
from ecommerce
group by customer_id
order by total_revenue desc
limit 10;

Done.

[('CUST3556', 13985),
 ('CUST4526', 12567),
 ('CUST2419', 12078),
 ('CUST2149', 11515),
 ('CUST1441', 11288),
 ('CUST3955', 10989),
 ('CUST5377', 10413),
 ('CUST4434', 10389),
 ('CUST4765', 10364),
 ('CUST5014', 10289)]

In [5]:
%load_ext sql
%sql mysql+mysqlconnector://root:root01@localhost/test

In [8]:
# Top 10 products based on revenue

%%sql
select product_id, product_name, sum(quantity * unit_price) AS revenue
from ecommerce
group by product_name
order by revenue DESC
limit 10;

   mysql+mysqlconnector://root:***@localhost/test
 * sqlite:///ecommerce.db
Done.

[('PROD100', 'iPhone 14', 1881117),
 ('PROD101', 'Samsung Galaxy S23', 1780919),
 ('PROD107', 'Dyson Vacuum', 876204),
 ('PROD108', 'Fitbit Versa 3', 442886),
 ('PROD102', 'Sony Headphones', 425064),
 ('PROD112', 'Barbie Dreamhouse', 384667),
 ('PROD113', 'Wilson Tennis Racket', 290550),
 ('PROD109', 'Kindle Paperwhite', 254517),
 ('PROD104', 'Nike Air Max', 245040),
 ('PROD105', 'Adidas Running Shoes', 230230)]

In [10]:
# Average order value

%%sql
select avg(order_value) as avg_order_value
from (
    select order_id, sum(quantity * unit_price) as order_value
    from ecommerce
    group by order_id
);

   mysql+mysqlconnector://root:***@localhost/test
 * sqlite:///ecommerce.db
Done.

[(745.0763,)]

In [11]:
# top 5 countries by total order

%%sql
select country, count(distinct order_id) as total_orders
from ecommerce
group by country
order by total_orders desc
limit 5;

   mysql+mysqlconnector://root:***@localhost/test
 * sqlite:///ecommerce.db
Done.

[('France', 1060),
 ('China', 1054),
 ('Australia', 1043),
 ('India', 1036),
 ('Brazil', 1019)]

In [14]:
# Customer those who spend more than 5000

%%sql
select customer_id, sum(quantity * unit_price) as total_spent
from ecommerce
group by customer_id
having sum(quantity * unit_price) > 5000
order by total_spent desc
limit 5;

   mysql+mysqlconnector://root:***@localhost/test
 * sqlite:///ecommerce.db
Done.

[('CUST3556', 13985),
 ('CUST4526', 12567),
 ('CUST2419', 12078),
 ('CUST2149', 11515),
 ('CUST1441', 11288)]

In [15]:
# To get Customer name with their whole Spending using Inner Join

%%sql
    select e.customer_id,
       e.first_name || ' ' || e.last_name as customer_name,
       sum(e.quantity * e.unit_price) as total_spent
from ecommerce e
inner join (
    select customer_id
    from ecommerce
    group by customer_id
) c on e.customer_id = c.customer_id
group by e.customer_id, customer_name
order by total_spent DESC
limit 10;

   mysql+mysqlconnector://root:***@localhost/test
 * sqlite:///ecommerce.db
Done.

[('CUST3556', 'Beverly Gallagher', 13985),
 ('CUST4526', 'Pamela Lyons', 12567),
 ('CUST2419', 'Michelle Oliver', 12078),
 ('CUST2149', 'Ricardo Brooks', 11515),
 ('CUST1441', 'Steven Walker', 11288),
 ('CUST3955', 'Dawn Mcpherson', 10989),
 ('CUST5377', 'Dale Joyce', 10413),
 ('CUST4434', 'Shannon Jenkins', 10389),
 ('CUST4765', 'Darryl Ward', 10364),
 ('CUST5014', 'Kelly Mcmahon', 10289)]

In [18]:
# Customer who spends more than the average customer %%sql
select customer_id, sum(quantity * unit_price) as total_spent
from ecommerce
group by customer_id
having sum(quantity * unit_price) > (
    select avg(customer_total)
    from (
        select sum(quantity * unit_price) as customer_total
        from ecommerce
        group by customer_id
    )
)
order by total_spent DESC
limit 10;

   mysql+mysqlconnector://root:***@localhost/test
 * sqlite:///ecommerce.db
Done.

[('CUST3556', 13985),
 ('CUST4526', 12567),
 ('CUST2419', 12078),
 ('CUST2149', 11515),
 ('CUST1441', 11288),
 ('CUST3955', 10989),
 ('CUST5377', 10413),
 ('CUST4434', 10389),
 ('CUST4765', 10364),
 ('CUST5014', 10289)]